title: Multiple Failed Logins
id: 10002
description: Detects brute-force attempts by spotting repeated login failures
author: hello
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4625
  timeframe: 1m
  condition: selection | count >= 5
level: medium
tags:
  - attack.credential_access
  - attack.t1110
