title: New Scheduled Task Creation
id: 10010
description: Detects use of schtasks.exe — often used for persistence
author: hello
logsource:
  category: process_creation
detection:
  selection:
    Image|endswith: schtasks.exe
    CommandLine|contains:
      - "/create"
  condition: selection
level: medium
tags:
  - attack.persistence
  - attack.t1053.005
