title: Suspicious Base64 in PowerShell
id: 10008
description: Detects long base64-encoded PowerShell commands
author: hello
logsource:
  category: process_creation
detection:
  selection:
    Image|endswith: powershell.exe
    CommandLine|contains: " -enc "
  condition: selection
level: high
tags:
  - attack.defense_evasion
  - attack.t1027
  - attack.t1059
