title: Suspicious PowerShell Download
id: 10001
description: Detects PowerShell scripts downloading files using known web commands
author: hello
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: powershell.exe
    CommandLine|contains:
      - "Invoke-WebRequest"
      - "Invoke-Expression"
      - "Start-BitsTransfer"
      - "DownloadFile"
  condition: selection
level: high
tags:
  - attack.execution
  - attack.t1059.001
  - attack.t1105
