title: WMI Execution Detected
id: 10006
description: Detects use of WMIC for executing remote commands
author: hello
logsource:
  category: process_creation
detection:
  selection:
    Image|endswith: wmic.exe
    CommandLine|contains: "process call create"
  condition: selection
level: high
tags:
  - attack.execution
  - attack.t1047
